The element id of a topography surface created by the introduction of this building pad.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public ElementId AssociatedTopographySurfaceId { get; }
  Visual Basic
Public ReadOnly Property AssociatedTopographySurfaceId As ElementId
	Get
  Visual C++
public:
property ElementId^ AssociatedTopographySurfaceId {
	ElementId^ get ();
}
 See Also
  BuildingPad Class
  Autodesk.Revit.DB.Architecture Namespace